// Завдання 1:
// Створіть клас «Фільм», який має зберігати таку інформацію:
    //  назва фільму;
    //  назва кіностудії;
    //  жанр;
    //  тривалість;
    //  рік.
    // Реалізуйте у класі методи та властивості, необхідні для
    // функціонування класу.
    // Додайте до класу деструктор. Напишіть код для тестування
// функціональності класу.
    // Напишіть код для деструктора

    // Завдання 3:
    // Додайте до першого завдання реалізацію інтерфейсу IDisposable. 
class Program
{
    static void Main()
    {
        Film film1 = new Film("Inception", "Warner Bros.", "Sci-Fi", 148, 2010);

        Console.WriteLine(film1);
        film1.Dispose();
    }
}